shorepine/tulipcc/tulip/amyboard/boards/AMYBOARD/mpconfigboard.h
#include "pins.h"
#define MICROPY_HW_BOARD_NAME               "AMYboard"
#define MICROPY_HW_MCU_NAME                 "ESP32S3"

#define MICROPY_PY_MACHINE_DAC              (0)

// Enable UART REPL for modules that have an external USB-UART and don't use native USB.
#define MICROPY_HW_ENABLE_UART_REPL         (1)

